1) Какие у вас ожидания от курса? Есть ли конкретные вопросы по теме Базы данных?

Ответ:
Научиться правильно составлять запросы для соединения нескольких таблиц
Обновлять данные в таблице по параметрам
Сортировать данные в таблицах по параметрам
Удалять данные в таблице, соответсвующее определенным параметрам (например занные за определенную дату)
На основе существующих
Не отвлекать разработчика и самостоятельно выполнять данные процедуры
Так же было бы неплохо научиться создавать свои функции например для заполенния таблицы рандомными данными

2) В какой сфере работаете сейчас?
Ответ: в IT

3) Если в IT, то какой у вас опыт (инструменты, технологии, языки программирования)?
инструменты Jira, Confluence, Git, в БД oracle и postgresql простые селекты, простые апдейты, каких либо колонок, язык програмирования в начальной стадии Python